test/request-response-samples/UpdateProfile__correct_namespaces_for_elements_with_base/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header/>
  <soap:Body>
    <ns1:UpdateProfileRequest xmlns:ns1="http://www.bigdatacollect.or/Name/Types">
      <ns1:Profile>
        <ns1:IDs>
          <ns2:UniqueID xmlns:ns2="http://www.bigdatacollect.or/Common/Types" source="TESTSOURCE">100</ns2:UniqueID>
        </ns1:IDs>
        <ns1:Phones>
          <ns1:NamePhone primary="true">
            <ns2:PhoneData xmlns:ns2="http://www.bigdatacollect.or/Common/Types">
              <ns2:PhoneNumber>123</ns2:PhoneNumber>
            </ns2:PhoneData>
          </ns1:NamePhone>
          <ns1:NamePhone primary="false">
            <ns2:PhoneData xmlns:ns2="http://www.bigdatacollect.or/Common/Types">
              <ns2:PhoneNumber>456</ns2:PhoneNumber>
            </ns2:PhoneData>
          </ns1:NamePhone>
        </ns1:Phones>
        <ns1:Addresses>
          <ns1:NameAddress>
            <ns2:AddressLine xmlns:ns2="http://www.bigdatacollect.or/Common/Types">Another Address</ns2:AddressLine>
          </ns1:NameAddress>
          <ns1:NameAddress>
            <ns2:AddressLine xmlns:ns2="http://www.bigdatacollect.or/Common/Types">My Address</ns2:AddressLine>
          </ns1:NameAddress>
        </ns1:Addresses>
      </ns1:Profile>
    </ns1:UpdateProfileRequest>
  </soap:Body>
</soap:Envelope>
